OpenFOAM-7/tutorials/pelletExtruder/tests/PolymK+hPolym+Tait/PruebaMalla2D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }   
    
    wall1
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    wall2
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    output
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    input
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
