OpenFOAM-7/tutorials/pelletExtruder/tests/PolymK+hPolym+Tait/PruebaMalla2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            empty;
        inGroups        List<word> 1(wall);
        nFaces          2720;
        startFace       5323;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(wall);
        nFaces          2720;
        startFace       8043;
    }
    input
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          32;
        startFace       10763;
    }
    output
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          32;
        startFace       10795;
    }
    wall2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          90;
        startFace       10827;
    }
    wall1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       10917;
    }
)

// ************************************************************************* //
